% 1 - Задаємо вектори
disp("----------#1----------")
A = [3 9 5];
B = [2 1 5];
disp("A = " + mat2str(A))
disp("B = " + mat2str(B))

% 2 - Обчислюємо оператори
disp(newline + "----------#2----------")
disp("C = " + mat2str(A./B.^2))
disp("C = " + mat2str((A./B).^2))
disp("B = " + (sqrt(A(2)) + 2*B(1)))

% 3 - Порівнюємо два масиви
disp(newline + "----------#3----------")
A = [2 7 6 ; 9 0 -1 ; 3 0.5 6];
B = [8 0.2 0; -3 2 5; 4 -1 7];
disp("A < B:")
disp(A < B)

% 4 - Обчислюємо підпрограму
disp("----------#4----------")
x(1) = 2;
for i = 2:6
    x(i) = 2*x(i-1);
end
disp("x: " + mat2str(x))

% 5 - Обчислюємо оператор
disp(newline + "----------#5----------")
disp('A:')
disp(magic(4))

% 6 - Викликаємо myfile
disp(newline + "----------#6----------")
a = 7.5;
b = 3.342;
disp("c = " + myfile(a,b))

% 7 - Формуємо тривимірний масив нормально розподілених випадкових чисел розміром 4 х 3 х 2.
disp(newline + "----------#7----------")
B = rand(4,3,2)

% 8 - Задаємо синусоїду 10 точками і виконуємо інтерполяцію,використовуючи рідку сітку.
x = 0:10;
y = sin(x);
xi = 0:0.25:10;
yi = spline (x,y,xi);
plot (x,y,'o',xi,yi,'r'), grid